Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPfi_reg.h
/**
 * \file IfxPfi_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC39XA_ITS_V3.0.R0
 * Specification: PFI_AURIXTC3XX_its_MCSFR.xml
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Pfi_Cfg Pfi address
 * \ingroup IfxLld_Pfi
 * 
 * \defgroup IfxLld_Pfi_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Pfi_Cfg
 * 
 * \defgroup IfxLld_Pfi_Cfg_Pfi00 2-PFI00
 * \ingroup IfxLld_Pfi_Cfg
 * 
 * \defgroup IfxLld_Pfi_Cfg_Pfi01 2-PFI01
 * \ingroup IfxLld_Pfi_Cfg
 * 
 * \defgroup IfxLld_Pfi_Cfg_Pfi02 2-PFI02
 * \ingroup IfxLld_Pfi_Cfg
 * 
 * \defgroup IfxLld_Pfi_Cfg_Pfi03 2-PFI03
 * \ingroup IfxLld_Pfi_Cfg
 * 
 * \defgroup IfxLld_Pfi_Cfg_Pfi04 2-PFI04
 * \ingroup IfxLld_Pfi_Cfg
 * 
 * \defgroup IfxLld_Pfi_Cfg_Pfi05 2-PFI05
 * \ingroup IfxLld_Pfi_Cfg
 * 
 */
#ifndef IFXPFI_REG_H
#define IFXPFI_REG_H 1
/******************************************************************************/
#include "IfxPfi_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Pfi_Cfg_BaseAddress
 * \{  */

/** \brief  PFI object */
#define MODULE_PFI00 /*lint --e(923)*/ (*(Ifx_PFI*)0xA8080000u)

/** \brief  PFI object */
#define MODULE_PFI01 /*lint --e(923)*/ (*(Ifx_PFI*)0xA8380000u)

/** \brief  PFI object */
#define MODULE_PFI02 /*lint --e(923)*/ (*(Ifx_PFI*)0xA8680000u)

/** \brief  PFI object */
#define MODULE_PFI03 /*lint --e(923)*/ (*(Ifx_PFI*)0xA8980000u)

/** \brief  PFI object */
#define MODULE_PFI04 /*lint --e(923)*/ (*(Ifx_PFI*)0xA8C80000u)

/** \brief  PFI object */
#define MODULE_PFI05 /*lint --e(923)*/ (*(Ifx_PFI*)0xA8F80000u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pfi_Cfg_Pfi00
 * \{  */


/** \brief  4000, DBAB Record */
#define PFI00_DBAB0_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8084000u)

/** Alias (User Manual Name) for PFI00_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI00_DBAB0_DBABRECORD.
*/
#define	PFI0_DBABRECORD0	(PFI00_DBAB0_DBABRECORD)

/** \brief  4020, DBAB Record */
#define PFI00_DBAB1_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8084020u)

/** Alias (User Manual Name) for PFI00_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI00_DBAB1_DBABRECORD.
*/
#define	PFI0_DBABRECORD1	(PFI00_DBAB1_DBABRECORD)

/** \brief  0, ECC Read Register */
#define PFI00_ECCR /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCR*)0xA8080000u)

/** Alias (User Manual Name) for PFI00_ECCR.
* To use register names with standard convension, please use PFI00_ECCR.
*/
#define	PFI0_ECCR	(PFI00_ECCR)

/** \brief  20, ECC Status Register */
#define PFI00_ECCS /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCS*)0xA8080020u)

/** Alias (User Manual Name) for PFI00_ECCS.
* To use register names with standard convension, please use PFI00_ECCS.
*/
#define	PFI0_ECCS	(PFI00_ECCS)

/** \brief  8000, MBAB Record */
#define PFI00_MBAB0_MBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_MBABRECORD*)0xA8088000u)

/** Alias (User Manual Name) for PFI00_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI00_MBAB0_MBABRECORD.
*/
#define	PFI0_MBABRECORD0	(PFI00_MBAB0_MBABRECORD)

/** \brief  2000, SBAB Record */
#define PFI00_SBAB0_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082000u)

/** Alias (User Manual Name) for PFI00_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB0_SBABRECORD.
*/
#define	PFI0_SBABRECORD0	(PFI00_SBAB0_SBABRECORD)

/** \brief  2140, SBAB Record */
#define PFI00_SBAB10_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082140u)

/** Alias (User Manual Name) for PFI00_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB10_SBABRECORD.
*/
#define	PFI0_SBABRECORD10	(PFI00_SBAB10_SBABRECORD)

/** \brief  2160, SBAB Record */
#define PFI00_SBAB11_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082160u)

/** Alias (User Manual Name) for PFI00_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB11_SBABRECORD.
*/
#define	PFI0_SBABRECORD11	(PFI00_SBAB11_SBABRECORD)

/** \brief  2180, SBAB Record */
#define PFI00_SBAB12_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082180u)

/** Alias (User Manual Name) for PFI00_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB12_SBABRECORD.
*/
#define	PFI0_SBABRECORD12	(PFI00_SBAB12_SBABRECORD)

/** \brief  21A0, SBAB Record */
#define PFI00_SBAB13_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA80821A0u)

/** Alias (User Manual Name) for PFI00_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB13_SBABRECORD.
*/
#define	PFI0_SBABRECORD13	(PFI00_SBAB13_SBABRECORD)

/** \brief  21C0, SBAB Record */
#define PFI00_SBAB14_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA80821C0u)

/** Alias (User Manual Name) for PFI00_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB14_SBABRECORD.
*/
#define	PFI0_SBABRECORD14	(PFI00_SBAB14_SBABRECORD)

/** \brief  21E0, SBAB Record */
#define PFI00_SBAB15_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA80821E0u)

/** Alias (User Manual Name) for PFI00_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB15_SBABRECORD.
*/
#define	PFI0_SBABRECORD15	(PFI00_SBAB15_SBABRECORD)

/** \brief  2200, SBAB Record */
#define PFI00_SBAB16_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082200u)

/** Alias (User Manual Name) for PFI00_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB16_SBABRECORD.
*/
#define	PFI0_SBABRECORD16	(PFI00_SBAB16_SBABRECORD)

/** \brief  2020, SBAB Record */
#define PFI00_SBAB1_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082020u)

