Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPfi_reg.h
/** Alias (User Manual Name) for PFI00_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB1_SBABRECORD.
*/
#define	PFI0_SBABRECORD1	(PFI00_SBAB1_SBABRECORD)

/** \brief  2040, SBAB Record */
#define PFI00_SBAB2_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082040u)

/** Alias (User Manual Name) for PFI00_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB2_SBABRECORD.
*/
#define	PFI0_SBABRECORD2	(PFI00_SBAB2_SBABRECORD)

/** \brief  2060, SBAB Record */
#define PFI00_SBAB3_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082060u)

/** Alias (User Manual Name) for PFI00_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB3_SBABRECORD.
*/
#define	PFI0_SBABRECORD3	(PFI00_SBAB3_SBABRECORD)

/** \brief  2080, SBAB Record */
#define PFI00_SBAB4_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082080u)

/** Alias (User Manual Name) for PFI00_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB4_SBABRECORD.
*/
#define	PFI0_SBABRECORD4	(PFI00_SBAB4_SBABRECORD)

/** \brief  20A0, SBAB Record */
#define PFI00_SBAB5_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA80820A0u)

/** Alias (User Manual Name) for PFI00_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB5_SBABRECORD.
*/
#define	PFI0_SBABRECORD5	(PFI00_SBAB5_SBABRECORD)

/** \brief  20C0, SBAB Record */
#define PFI00_SBAB6_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA80820C0u)

/** Alias (User Manual Name) for PFI00_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB6_SBABRECORD.
*/
#define	PFI0_SBABRECORD6	(PFI00_SBAB6_SBABRECORD)

/** \brief  20E0, SBAB Record */
#define PFI00_SBAB7_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA80820E0u)

/** Alias (User Manual Name) for PFI00_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB7_SBABRECORD.
*/
#define	PFI0_SBABRECORD7	(PFI00_SBAB7_SBABRECORD)

/** \brief  2100, SBAB Record */
#define PFI00_SBAB8_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082100u)

/** Alias (User Manual Name) for PFI00_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB8_SBABRECORD.
*/
#define	PFI0_SBABRECORD8	(PFI00_SBAB8_SBABRECORD)

/** \brief  2120, SBAB Record */
#define PFI00_SBAB9_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8082120u)

/** Alias (User Manual Name) for PFI00_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI00_SBAB9_SBABRECORD.
*/
#define	PFI0_SBABRECORD9	(PFI00_SBAB9_SBABRECORD)

/** \brief  C000, ZBAB Record */
#define PFI00_ZBAB0_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA808C000u)

/** Alias (User Manual Name) for PFI00_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI00_ZBAB0_ZBABRECORD.
*/
#define	PFI0_ZBABRECORD0	(PFI00_ZBAB0_ZBABRECORD)

/** \brief  C020, ZBAB Record */
#define PFI00_ZBAB1_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA808C020u)

/** Alias (User Manual Name) for PFI00_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI00_ZBAB1_ZBABRECORD.
*/
#define	PFI0_ZBABRECORD1	(PFI00_ZBAB1_ZBABRECORD)

/** \brief  C040, ZBAB Record */
#define PFI00_ZBAB2_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA808C040u)

/** Alias (User Manual Name) for PFI00_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI00_ZBAB2_ZBABRECORD.
*/
#define	PFI0_ZBABRECORD2	(PFI00_ZBAB2_ZBABRECORD)

/** \brief  C060, ZBAB Record */
#define PFI00_ZBAB3_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA808C060u)

/** Alias (User Manual Name) for PFI00_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI00_ZBAB3_ZBABRECORD.
*/
#define	PFI0_ZBABRECORD3	(PFI00_ZBAB3_ZBABRECORD)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pfi_Cfg_Pfi01
 * \{  */

/** \brief  4000, DBAB Record */
#define PFI01_DBAB0_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8384000u)

/** Alias (User Manual Name) for PFI01_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI01_DBAB0_DBABRECORD.
*/
#define	PFI1_DBABRECORD0	(PFI01_DBAB0_DBABRECORD)

/** \brief  4020, DBAB Record */
#define PFI01_DBAB1_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8384020u)

/** Alias (User Manual Name) for PFI01_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI01_DBAB1_DBABRECORD.
*/
#define	PFI1_DBABRECORD1	(PFI01_DBAB1_DBABRECORD)

/** \brief  0, ECC Read Register */
#define PFI01_ECCR /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCR*)0xA8380000u)

/** Alias (User Manual Name) for PFI01_ECCR.
* To use register names with standard convension, please use PFI01_ECCR.
*/
#define	PFI1_ECCR	(PFI01_ECCR)

/** \brief  20, ECC Status Register */
#define PFI01_ECCS /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCS*)0xA8380020u)

/** Alias (User Manual Name) for PFI01_ECCS.
* To use register names with standard convension, please use PFI01_ECCS.
*/
#define	PFI1_ECCS	(PFI01_ECCS)

/** \brief  8000, MBAB Record */
#define PFI01_MBAB0_MBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_MBABRECORD*)0xA8388000u)

/** Alias (User Manual Name) for PFI01_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI01_MBAB0_MBABRECORD.
*/
#define	PFI1_MBABRECORD0	(PFI01_MBAB0_MBABRECORD)

/** \brief  2000, SBAB Record */
#define PFI01_SBAB0_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382000u)

/** Alias (User Manual Name) for PFI01_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB0_SBABRECORD.
*/
#define	PFI1_SBABRECORD0	(PFI01_SBAB0_SBABRECORD)

/** \brief  2140, SBAB Record */
#define PFI01_SBAB10_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382140u)

/** Alias (User Manual Name) for PFI01_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB10_SBABRECORD.
*/
#define	PFI1_SBABRECORD10	(PFI01_SBAB10_SBABRECORD)

/** \brief  2160, SBAB Record */
#define PFI01_SBAB11_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382160u)

/** Alias (User Manual Name) for PFI01_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB11_SBABRECORD.
*/
#define	PFI1_SBABRECORD11	(PFI01_SBAB11_SBABRECORD)

