Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPfi_reg.h
/** \brief  2180, SBAB Record */
#define PFI01_SBAB12_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382180u)

/** Alias (User Manual Name) for PFI01_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB12_SBABRECORD.
*/
#define	PFI1_SBABRECORD12	(PFI01_SBAB12_SBABRECORD)

/** \brief  21A0, SBAB Record */
#define PFI01_SBAB13_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA83821A0u)

/** Alias (User Manual Name) for PFI01_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB13_SBABRECORD.
*/
#define	PFI1_SBABRECORD13	(PFI01_SBAB13_SBABRECORD)

/** \brief  21C0, SBAB Record */
#define PFI01_SBAB14_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA83821C0u)

/** Alias (User Manual Name) for PFI01_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB14_SBABRECORD.
*/
#define	PFI1_SBABRECORD14	(PFI01_SBAB14_SBABRECORD)

/** \brief  21E0, SBAB Record */
#define PFI01_SBAB15_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA83821E0u)

/** Alias (User Manual Name) for PFI01_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB15_SBABRECORD.
*/
#define	PFI1_SBABRECORD15	(PFI01_SBAB15_SBABRECORD)

/** \brief  2200, SBAB Record */
#define PFI01_SBAB16_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382200u)

/** Alias (User Manual Name) for PFI01_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB16_SBABRECORD.
*/
#define	PFI1_SBABRECORD16	(PFI01_SBAB16_SBABRECORD)

/** \brief  2020, SBAB Record */
#define PFI01_SBAB1_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382020u)

/** Alias (User Manual Name) for PFI01_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB1_SBABRECORD.
*/
#define	PFI1_SBABRECORD1	(PFI01_SBAB1_SBABRECORD)

/** \brief  2040, SBAB Record */
#define PFI01_SBAB2_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382040u)

/** Alias (User Manual Name) for PFI01_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB2_SBABRECORD.
*/
#define	PFI1_SBABRECORD2	(PFI01_SBAB2_SBABRECORD)

/** \brief  2060, SBAB Record */
#define PFI01_SBAB3_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382060u)

/** Alias (User Manual Name) for PFI01_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB3_SBABRECORD.
*/
#define	PFI1_SBABRECORD3	(PFI01_SBAB3_SBABRECORD)

/** \brief  2080, SBAB Record */
#define PFI01_SBAB4_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382080u)

/** Alias (User Manual Name) for PFI01_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB4_SBABRECORD.
*/
#define	PFI1_SBABRECORD4	(PFI01_SBAB4_SBABRECORD)

/** \brief  20A0, SBAB Record */
#define PFI01_SBAB5_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA83820A0u)

/** Alias (User Manual Name) for PFI01_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB5_SBABRECORD.
*/
#define	PFI1_SBABRECORD5	(PFI01_SBAB5_SBABRECORD)

/** \brief  20C0, SBAB Record */
#define PFI01_SBAB6_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA83820C0u)

/** Alias (User Manual Name) for PFI01_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB6_SBABRECORD.
*/
#define	PFI1_SBABRECORD6	(PFI01_SBAB6_SBABRECORD)

/** \brief  20E0, SBAB Record */
#define PFI01_SBAB7_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA83820E0u)

/** Alias (User Manual Name) for PFI01_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB7_SBABRECORD.
*/
#define	PFI1_SBABRECORD7	(PFI01_SBAB7_SBABRECORD)

/** \brief  2100, SBAB Record */
#define PFI01_SBAB8_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382100u)

/** Alias (User Manual Name) for PFI01_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB8_SBABRECORD.
*/
#define	PFI1_SBABRECORD8	(PFI01_SBAB8_SBABRECORD)

/** \brief  2120, SBAB Record */
#define PFI01_SBAB9_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8382120u)

/** Alias (User Manual Name) for PFI01_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI01_SBAB9_SBABRECORD.
*/
#define	PFI1_SBABRECORD9	(PFI01_SBAB9_SBABRECORD)

/** \brief  C000, ZBAB Record */
#define PFI01_ZBAB0_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA838C000u)

/** Alias (User Manual Name) for PFI01_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI01_ZBAB0_ZBABRECORD.
*/
#define	PFI1_ZBABRECORD0	(PFI01_ZBAB0_ZBABRECORD)

/** \brief  C020, ZBAB Record */
#define PFI01_ZBAB1_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA838C020u)

/** Alias (User Manual Name) for PFI01_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI01_ZBAB1_ZBABRECORD.
*/
#define	PFI1_ZBABRECORD1	(PFI01_ZBAB1_ZBABRECORD)

/** \brief  C040, ZBAB Record */
#define PFI01_ZBAB2_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA838C040u)

/** Alias (User Manual Name) for PFI01_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI01_ZBAB2_ZBABRECORD.
*/
#define	PFI1_ZBABRECORD2	(PFI01_ZBAB2_ZBABRECORD)

/** \brief  C060, ZBAB Record */
#define PFI01_ZBAB3_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA838C060u)

/** Alias (User Manual Name) for PFI01_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI01_ZBAB3_ZBABRECORD.
*/
#define	PFI1_ZBABRECORD3	(PFI01_ZBAB3_ZBABRECORD)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pfi_Cfg_Pfi02
 * \{  */

/** \brief  4000, DBAB Record */
#define PFI02_DBAB0_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8684000u)

/** Alias (User Manual Name) for PFI02_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI02_DBAB0_DBABRECORD.
*/
#define	PFI2_DBABRECORD0	(PFI02_DBAB0_DBABRECORD)

/** \brief  4020, DBAB Record */
#define PFI02_DBAB1_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8684020u)

/** Alias (User Manual Name) for PFI02_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI02_DBAB1_DBABRECORD.
*/
#define	PFI2_DBABRECORD1	(PFI02_DBAB1_DBABRECORD)

