Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPfi_reg.h
/** \brief  0, ECC Read Register */
#define PFI02_ECCR /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCR*)0xA8680000u)

/** Alias (User Manual Name) for PFI02_ECCR.
* To use register names with standard convension, please use PFI02_ECCR.
*/
#define	PFI2_ECCR	(PFI02_ECCR)

/** \brief  20, ECC Status Register */
#define PFI02_ECCS /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCS*)0xA8680020u)

/** Alias (User Manual Name) for PFI02_ECCS.
* To use register names with standard convension, please use PFI02_ECCS.
*/
#define	PFI2_ECCS	(PFI02_ECCS)

/** \brief  8000, MBAB Record */
#define PFI02_MBAB0_MBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_MBABRECORD*)0xA8688000u)

/** Alias (User Manual Name) for PFI02_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI02_MBAB0_MBABRECORD.
*/
#define	PFI2_MBABRECORD0	(PFI02_MBAB0_MBABRECORD)

/** \brief  2000, SBAB Record */
#define PFI02_SBAB0_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682000u)

/** Alias (User Manual Name) for PFI02_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB0_SBABRECORD.
*/
#define	PFI2_SBABRECORD0	(PFI02_SBAB0_SBABRECORD)

/** \brief  2140, SBAB Record */
#define PFI02_SBAB10_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682140u)

/** Alias (User Manual Name) for PFI02_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB10_SBABRECORD.
*/
#define	PFI2_SBABRECORD10	(PFI02_SBAB10_SBABRECORD)

/** \brief  2160, SBAB Record */
#define PFI02_SBAB11_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682160u)

/** Alias (User Manual Name) for PFI02_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB11_SBABRECORD.
*/
#define	PFI2_SBABRECORD11	(PFI02_SBAB11_SBABRECORD)

/** \brief  2180, SBAB Record */
#define PFI02_SBAB12_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682180u)

/** Alias (User Manual Name) for PFI02_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB12_SBABRECORD.
*/
#define	PFI2_SBABRECORD12	(PFI02_SBAB12_SBABRECORD)

/** \brief  21A0, SBAB Record */
#define PFI02_SBAB13_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA86821A0u)

/** Alias (User Manual Name) for PFI02_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB13_SBABRECORD.
*/
#define	PFI2_SBABRECORD13	(PFI02_SBAB13_SBABRECORD)

/** \brief  21C0, SBAB Record */
#define PFI02_SBAB14_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA86821C0u)

/** Alias (User Manual Name) for PFI02_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB14_SBABRECORD.
*/
#define	PFI2_SBABRECORD14	(PFI02_SBAB14_SBABRECORD)

/** \brief  21E0, SBAB Record */
#define PFI02_SBAB15_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA86821E0u)

/** Alias (User Manual Name) for PFI02_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB15_SBABRECORD.
*/
#define	PFI2_SBABRECORD15	(PFI02_SBAB15_SBABRECORD)

/** \brief  2200, SBAB Record */
#define PFI02_SBAB16_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682200u)

/** Alias (User Manual Name) for PFI02_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB16_SBABRECORD.
*/
#define	PFI2_SBABRECORD16	(PFI02_SBAB16_SBABRECORD)

/** \brief  2020, SBAB Record */
#define PFI02_SBAB1_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682020u)

/** Alias (User Manual Name) for PFI02_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB1_SBABRECORD.
*/
#define	PFI2_SBABRECORD1	(PFI02_SBAB1_SBABRECORD)

/** \brief  2040, SBAB Record */
#define PFI02_SBAB2_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682040u)

/** Alias (User Manual Name) for PFI02_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB2_SBABRECORD.
*/
#define	PFI2_SBABRECORD2	(PFI02_SBAB2_SBABRECORD)

/** \brief  2060, SBAB Record */
#define PFI02_SBAB3_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682060u)

/** Alias (User Manual Name) for PFI02_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB3_SBABRECORD.
*/
#define	PFI2_SBABRECORD3	(PFI02_SBAB3_SBABRECORD)

/** \brief  2080, SBAB Record */
#define PFI02_SBAB4_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682080u)

/** Alias (User Manual Name) for PFI02_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB4_SBABRECORD.
*/
#define	PFI2_SBABRECORD4	(PFI02_SBAB4_SBABRECORD)

/** \brief  20A0, SBAB Record */
#define PFI02_SBAB5_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA86820A0u)

/** Alias (User Manual Name) for PFI02_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB5_SBABRECORD.
*/
#define	PFI2_SBABRECORD5	(PFI02_SBAB5_SBABRECORD)

/** \brief  20C0, SBAB Record */
#define PFI02_SBAB6_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA86820C0u)

/** Alias (User Manual Name) for PFI02_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB6_SBABRECORD.
*/
#define	PFI2_SBABRECORD6	(PFI02_SBAB6_SBABRECORD)

/** \brief  20E0, SBAB Record */
#define PFI02_SBAB7_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA86820E0u)

/** Alias (User Manual Name) for PFI02_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB7_SBABRECORD.
*/
#define	PFI2_SBABRECORD7	(PFI02_SBAB7_SBABRECORD)

/** \brief  2100, SBAB Record */
#define PFI02_SBAB8_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682100u)

/** Alias (User Manual Name) for PFI02_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB8_SBABRECORD.
*/
#define	PFI2_SBABRECORD8	(PFI02_SBAB8_SBABRECORD)

/** \brief  2120, SBAB Record */
#define PFI02_SBAB9_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8682120u)

