Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPfi_reg.h
/** Alias (User Manual Name) for PFI02_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI02_SBAB9_SBABRECORD.
*/
#define	PFI2_SBABRECORD9	(PFI02_SBAB9_SBABRECORD)

/** \brief  C000, ZBAB Record */
#define PFI02_ZBAB0_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA868C000u)

/** Alias (User Manual Name) for PFI02_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI02_ZBAB0_ZBABRECORD.
*/
#define	PFI2_ZBABRECORD0	(PFI02_ZBAB0_ZBABRECORD)

/** \brief  C020, ZBAB Record */
#define PFI02_ZBAB1_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA868C020u)

/** Alias (User Manual Name) for PFI02_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI02_ZBAB1_ZBABRECORD.
*/
#define	PFI2_ZBABRECORD1	(PFI02_ZBAB1_ZBABRECORD)

/** \brief  C040, ZBAB Record */
#define PFI02_ZBAB2_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA868C040u)

/** Alias (User Manual Name) for PFI02_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI02_ZBAB2_ZBABRECORD.
*/
#define	PFI2_ZBABRECORD2	(PFI02_ZBAB2_ZBABRECORD)

/** \brief  C060, ZBAB Record */
#define PFI02_ZBAB3_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA868C060u)

/** Alias (User Manual Name) for PFI02_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI02_ZBAB3_ZBABRECORD.
*/
#define	PFI2_ZBABRECORD3	(PFI02_ZBAB3_ZBABRECORD)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pfi_Cfg_Pfi03
 * \{  */


/** Alias (User Manual Name) for PFI03_BLADDR.
* To use register names with standard convension, please use PFI03_BLADDR.
*/
#define	PFI3_BLADDR	(PFI03_BLADDR)

/** \brief  4000, DBAB Record */
#define PFI03_DBAB0_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8984000u)

/** Alias (User Manual Name) for PFI03_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI03_DBAB0_DBABRECORD.
*/
#define	PFI3_DBABRECORD0	(PFI03_DBAB0_DBABRECORD)

/** \brief  4020, DBAB Record */
#define PFI03_DBAB1_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8984020u)

/** Alias (User Manual Name) for PFI03_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI03_DBAB1_DBABRECORD.
*/
#define	PFI3_DBABRECORD1	(PFI03_DBAB1_DBABRECORD)

/** \brief  0, ECC Read Register */
#define PFI03_ECCR /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCR*)0xA8980000u)

/** Alias (User Manual Name) for PFI03_ECCR.
* To use register names with standard convension, please use PFI03_ECCR.
*/
#define	PFI3_ECCR	(PFI03_ECCR)

/** \brief  20, ECC Status Register */
#define PFI03_ECCS /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCS*)0xA8980020u)

/** Alias (User Manual Name) for PFI03_ECCS.
* To use register names with standard convension, please use PFI03_ECCS.
*/
#define	PFI3_ECCS	(PFI03_ECCS)

/** \brief  8000, MBAB Record */
#define PFI03_MBAB0_MBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_MBABRECORD*)0xA8988000u)

/** Alias (User Manual Name) for PFI03_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI03_MBAB0_MBABRECORD.
*/
#define	PFI3_MBABRECORD0	(PFI03_MBAB0_MBABRECORD)

/** \brief  2000, SBAB Record */
#define PFI03_SBAB0_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982000u)

/** Alias (User Manual Name) for PFI03_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB0_SBABRECORD.
*/
#define	PFI3_SBABRECORD0	(PFI03_SBAB0_SBABRECORD)

/** \brief  2140, SBAB Record */
#define PFI03_SBAB10_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982140u)

/** Alias (User Manual Name) for PFI03_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB10_SBABRECORD.
*/
#define	PFI3_SBABRECORD10	(PFI03_SBAB10_SBABRECORD)

/** \brief  2160, SBAB Record */
#define PFI03_SBAB11_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982160u)

/** Alias (User Manual Name) for PFI03_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB11_SBABRECORD.
*/
#define	PFI3_SBABRECORD11	(PFI03_SBAB11_SBABRECORD)

/** \brief  2180, SBAB Record */
#define PFI03_SBAB12_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982180u)

/** Alias (User Manual Name) for PFI03_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB12_SBABRECORD.
*/
#define	PFI3_SBABRECORD12	(PFI03_SBAB12_SBABRECORD)

/** \brief  21A0, SBAB Record */
#define PFI03_SBAB13_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA89821A0u)

/** Alias (User Manual Name) for PFI03_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB13_SBABRECORD.
*/
#define	PFI3_SBABRECORD13	(PFI03_SBAB13_SBABRECORD)

/** \brief  21C0, SBAB Record */
#define PFI03_SBAB14_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA89821C0u)

/** Alias (User Manual Name) for PFI03_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB14_SBABRECORD.
*/
#define	PFI3_SBABRECORD14	(PFI03_SBAB14_SBABRECORD)

/** \brief  21E0, SBAB Record */
#define PFI03_SBAB15_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA89821E0u)

/** Alias (User Manual Name) for PFI03_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB15_SBABRECORD.
*/
#define	PFI3_SBABRECORD15	(PFI03_SBAB15_SBABRECORD)

/** \brief  2200, SBAB Record */
#define PFI03_SBAB16_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982200u)

/** Alias (User Manual Name) for PFI03_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB16_SBABRECORD.
*/
#define	PFI3_SBABRECORD16	(PFI03_SBAB16_SBABRECORD)

/** \brief  2020, SBAB Record */
#define PFI03_SBAB1_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982020u)

/** Alias (User Manual Name) for PFI03_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB1_SBABRECORD.
*/
#define	PFI3_SBABRECORD1	(PFI03_SBAB1_SBABRECORD)

/** \brief  2040, SBAB Record */
#define PFI03_SBAB2_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982040u)

/** Alias (User Manual Name) for PFI03_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB2_SBABRECORD.
*/
#define	PFI3_SBABRECORD2	(PFI03_SBAB2_SBABRECORD)

/** \brief  2060, SBAB Record */
#define PFI03_SBAB3_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982060u)

/** Alias (User Manual Name) for PFI03_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB3_SBABRECORD.
*/
#define	PFI3_SBABRECORD3	(PFI03_SBAB3_SBABRECORD)

