Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPfi_reg.h
/** \brief  2080, SBAB Record */
#define PFI03_SBAB4_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982080u)

/** Alias (User Manual Name) for PFI03_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB4_SBABRECORD.
*/
#define	PFI3_SBABRECORD4	(PFI03_SBAB4_SBABRECORD)

/** \brief  20A0, SBAB Record */
#define PFI03_SBAB5_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA89820A0u)

/** Alias (User Manual Name) for PFI03_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB5_SBABRECORD.
*/
#define	PFI3_SBABRECORD5	(PFI03_SBAB5_SBABRECORD)

/** \brief  20C0, SBAB Record */
#define PFI03_SBAB6_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA89820C0u)

/** Alias (User Manual Name) for PFI03_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB6_SBABRECORD.
*/
#define	PFI3_SBABRECORD6	(PFI03_SBAB6_SBABRECORD)

/** \brief  20E0, SBAB Record */
#define PFI03_SBAB7_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA89820E0u)

/** Alias (User Manual Name) for PFI03_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB7_SBABRECORD.
*/
#define	PFI3_SBABRECORD7	(PFI03_SBAB7_SBABRECORD)

/** \brief  2100, SBAB Record */
#define PFI03_SBAB8_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982100u)

/** Alias (User Manual Name) for PFI03_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB8_SBABRECORD.
*/
#define	PFI3_SBABRECORD8	(PFI03_SBAB8_SBABRECORD)

/** \brief  2120, SBAB Record */
#define PFI03_SBAB9_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8982120u)

/** Alias (User Manual Name) for PFI03_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI03_SBAB9_SBABRECORD.
*/
#define	PFI3_SBABRECORD9	(PFI03_SBAB9_SBABRECORD)

/** \brief  C000, ZBAB Record */
#define PFI03_ZBAB0_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA898C000u)

/** Alias (User Manual Name) for PFI03_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI03_ZBAB0_ZBABRECORD.
*/
#define	PFI3_ZBABRECORD0	(PFI03_ZBAB0_ZBABRECORD)

/** \brief  C020, ZBAB Record */
#define PFI03_ZBAB1_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA898C020u)

/** Alias (User Manual Name) for PFI03_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI03_ZBAB1_ZBABRECORD.
*/
#define	PFI3_ZBABRECORD1	(PFI03_ZBAB1_ZBABRECORD)

/** \brief  C040, ZBAB Record */
#define PFI03_ZBAB2_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA898C040u)

/** Alias (User Manual Name) for PFI03_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI03_ZBAB2_ZBABRECORD.
*/
#define	PFI3_ZBABRECORD2	(PFI03_ZBAB2_ZBABRECORD)

/** \brief  C060, ZBAB Record */
#define PFI03_ZBAB3_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA898C060u)

/** Alias (User Manual Name) for PFI03_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI03_ZBAB3_ZBABRECORD.
*/
#define	PFI3_ZBABRECORD3	(PFI03_ZBAB3_ZBABRECORD)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pfi_Cfg_Pfi04
 * \{  */

/** \brief  4000, DBAB Record */
#define PFI04_DBAB0_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8C84000u)

/** Alias (User Manual Name) for PFI04_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI04_DBAB0_DBABRECORD.
*/
#define	PFI4_DBABRECORD0	(PFI04_DBAB0_DBABRECORD)

/** \brief  4020, DBAB Record */
#define PFI04_DBAB1_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8C84020u)

/** Alias (User Manual Name) for PFI04_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI04_DBAB1_DBABRECORD.
*/
#define	PFI4_DBABRECORD1	(PFI04_DBAB1_DBABRECORD)

/** \brief  0, ECC Read Register */
#define PFI04_ECCR /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCR*)0xA8C80000u)

/** Alias (User Manual Name) for PFI04_ECCR.
* To use register names with standard convension, please use PFI04_ECCR.
*/
#define	PFI4_ECCR	(PFI04_ECCR)

/** \brief  20, ECC Status Register */
#define PFI04_ECCS /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCS*)0xA8C80020u)

/** Alias (User Manual Name) for PFI04_ECCS.
* To use register names with standard convension, please use PFI04_ECCS.
*/
#define	PFI4_ECCS	(PFI04_ECCS)

/** \brief  8000, MBAB Record */
#define PFI04_MBAB0_MBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_MBABRECORD*)0xA8C88000u)

/** Alias (User Manual Name) for PFI04_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI04_MBAB0_MBABRECORD.
*/
#define	PFI4_MBABRECORD0	(PFI04_MBAB0_MBABRECORD)

/** \brief  2000, SBAB Record */
#define PFI04_SBAB0_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82000u)

/** Alias (User Manual Name) for PFI04_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB0_SBABRECORD.
*/
#define	PFI4_SBABRECORD0	(PFI04_SBAB0_SBABRECORD)

/** \brief  2140, SBAB Record */
#define PFI04_SBAB10_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82140u)

/** Alias (User Manual Name) for PFI04_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB10_SBABRECORD.
*/
#define	PFI4_SBABRECORD10	(PFI04_SBAB10_SBABRECORD)

/** \brief  2160, SBAB Record */
#define PFI04_SBAB11_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82160u)

/** Alias (User Manual Name) for PFI04_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB11_SBABRECORD.
*/
#define	PFI4_SBABRECORD11	(PFI04_SBAB11_SBABRECORD)

/** \brief  2180, SBAB Record */
#define PFI04_SBAB12_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82180u)

/** Alias (User Manual Name) for PFI04_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB12_SBABRECORD.
*/
#define	PFI4_SBABRECORD12	(PFI04_SBAB12_SBABRECORD)

/** \brief  21A0, SBAB Record */
#define PFI04_SBAB13_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C821A0u)

/** Alias (User Manual Name) for PFI04_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB13_SBABRECORD.
*/
#define	PFI4_SBABRECORD13	(PFI04_SBAB13_SBABRECORD)

/** \brief  21C0, SBAB Record */
#define PFI04_SBAB14_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C821C0u)

/** Alias (User Manual Name) for PFI04_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB14_SBABRECORD.
*/
#define	PFI4_SBABRECORD14	(PFI04_SBAB14_SBABRECORD)

/** \brief  21E0, SBAB Record */
#define PFI04_SBAB15_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C821E0u)

/** Alias (User Manual Name) for PFI04_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB15_SBABRECORD.
*/
#define	PFI4_SBABRECORD15	(PFI04_SBAB15_SBABRECORD)

/** \brief  2200, SBAB Record */
#define PFI04_SBAB16_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82200u)

