Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPfi_reg.h
/** Alias (User Manual Name) for PFI04_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB16_SBABRECORD.
*/
#define	PFI4_SBABRECORD16	(PFI04_SBAB16_SBABRECORD)

/** \brief  2020, SBAB Record */
#define PFI04_SBAB1_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82020u)

/** Alias (User Manual Name) for PFI04_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB1_SBABRECORD.
*/
#define	PFI4_SBABRECORD1	(PFI04_SBAB1_SBABRECORD)

/** \brief  2040, SBAB Record */
#define PFI04_SBAB2_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82040u)

/** Alias (User Manual Name) for PFI04_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB2_SBABRECORD.
*/
#define	PFI4_SBABRECORD2	(PFI04_SBAB2_SBABRECORD)

/** \brief  2060, SBAB Record */
#define PFI04_SBAB3_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82060u)

/** Alias (User Manual Name) for PFI04_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB3_SBABRECORD.
*/
#define	PFI4_SBABRECORD3	(PFI04_SBAB3_SBABRECORD)

/** \brief  2080, SBAB Record */
#define PFI04_SBAB4_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82080u)

/** Alias (User Manual Name) for PFI04_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB4_SBABRECORD.
*/
#define	PFI4_SBABRECORD4	(PFI04_SBAB4_SBABRECORD)

/** \brief  20A0, SBAB Record */
#define PFI04_SBAB5_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C820A0u)

/** Alias (User Manual Name) for PFI04_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB5_SBABRECORD.
*/
#define	PFI4_SBABRECORD5	(PFI04_SBAB5_SBABRECORD)

/** \brief  20C0, SBAB Record */
#define PFI04_SBAB6_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C820C0u)

/** Alias (User Manual Name) for PFI04_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB6_SBABRECORD.
*/
#define	PFI4_SBABRECORD6	(PFI04_SBAB6_SBABRECORD)

/** \brief  20E0, SBAB Record */
#define PFI04_SBAB7_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C820E0u)

/** Alias (User Manual Name) for PFI04_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB7_SBABRECORD.
*/
#define	PFI4_SBABRECORD7	(PFI04_SBAB7_SBABRECORD)

/** \brief  2100, SBAB Record */
#define PFI04_SBAB8_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82100u)

/** Alias (User Manual Name) for PFI04_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB8_SBABRECORD.
*/
#define	PFI4_SBABRECORD8	(PFI04_SBAB8_SBABRECORD)

/** \brief  2120, SBAB Record */
#define PFI04_SBAB9_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8C82120u)

/** Alias (User Manual Name) for PFI04_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI04_SBAB9_SBABRECORD.
*/
#define	PFI4_SBABRECORD9	(PFI04_SBAB9_SBABRECORD)

/** \brief  C000, ZBAB Record */
#define PFI04_ZBAB0_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA8C8C000u)

/** Alias (User Manual Name) for PFI04_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI04_ZBAB0_ZBABRECORD.
*/
#define	PFI4_ZBABRECORD0	(PFI04_ZBAB0_ZBABRECORD)

/** \brief  C020, ZBAB Record */
#define PFI04_ZBAB1_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA8C8C020u)

/** Alias (User Manual Name) for PFI04_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI04_ZBAB1_ZBABRECORD.
*/
#define	PFI4_ZBABRECORD1	(PFI04_ZBAB1_ZBABRECORD)

/** \brief  C040, ZBAB Record */
#define PFI04_ZBAB2_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA8C8C040u)

/** Alias (User Manual Name) for PFI04_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI04_ZBAB2_ZBABRECORD.
*/
#define	PFI4_ZBABRECORD2	(PFI04_ZBAB2_ZBABRECORD)

/** \brief  C060, ZBAB Record */
#define PFI04_ZBAB3_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA8C8C060u)

/** Alias (User Manual Name) for PFI04_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI04_ZBAB3_ZBABRECORD.
*/
#define	PFI4_ZBABRECORD3	(PFI04_ZBAB3_ZBABRECORD)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Pfi_Cfg_Pfi05
 * \{  */

/** \brief  4000, DBAB Record */
#define PFI05_DBAB0_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8F84000u)

/** Alias (User Manual Name) for PFI05_DBAB0_DBABRECORD.
* To use register names with standard convension, please use PFI05_DBAB0_DBABRECORD.
*/
#define	PFI5_DBABRECORD0	(PFI05_DBAB0_DBABRECORD)

/** \brief  4020, DBAB Record */
#define PFI05_DBAB1_DBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_DBABRECORD*)0xA8F84020u)

/** Alias (User Manual Name) for PFI05_DBAB1_DBABRECORD.
* To use register names with standard convension, please use PFI05_DBAB1_DBABRECORD.
*/
#define	PFI5_DBABRECORD1	(PFI05_DBAB1_DBABRECORD)

/** \brief  0, ECC Read Register */
#define PFI05_ECCR /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCR*)0xA8F80000u)

/** Alias (User Manual Name) for PFI05_ECCR.
* To use register names with standard convension, please use PFI05_ECCR.
*/
#define	PFI5_ECCR	(PFI05_ECCR)

/** \brief  20, ECC Status Register */
#define PFI05_ECCS /*lint --e(923)*/ (*(volatile Ifx_PFI_ECCS*)0xA8F80020u)

/** Alias (User Manual Name) for PFI05_ECCS.
* To use register names with standard convension, please use PFI05_ECCS.
*/
#define	PFI5_ECCS	(PFI05_ECCS)

/** \brief  8000, MBAB Record */
#define PFI05_MBAB0_MBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_MBABRECORD*)0xA8F88000u)

/** Alias (User Manual Name) for PFI05_MBAB0_MBABRECORD.
* To use register names with standard convension, please use PFI05_MBAB0_MBABRECORD.
*/
#define	PFI5_MBABRECORD0	(PFI05_MBAB0_MBABRECORD)

