Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPfi_reg.h
/** \brief  2000, SBAB Record */
#define PFI05_SBAB0_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82000u)

/** Alias (User Manual Name) for PFI05_SBAB0_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB0_SBABRECORD.
*/
#define	PFI5_SBABRECORD0	(PFI05_SBAB0_SBABRECORD)

/** \brief  2140, SBAB Record */
#define PFI05_SBAB10_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82140u)

/** Alias (User Manual Name) for PFI05_SBAB10_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB10_SBABRECORD.
*/
#define	PFI5_SBABRECORD10	(PFI05_SBAB10_SBABRECORD)

/** \brief  2160, SBAB Record */
#define PFI05_SBAB11_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82160u)

/** Alias (User Manual Name) for PFI05_SBAB11_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB11_SBABRECORD.
*/
#define	PFI5_SBABRECORD11	(PFI05_SBAB11_SBABRECORD)

/** \brief  2180, SBAB Record */
#define PFI05_SBAB12_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82180u)

/** Alias (User Manual Name) for PFI05_SBAB12_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB12_SBABRECORD.
*/
#define	PFI5_SBABRECORD12	(PFI05_SBAB12_SBABRECORD)

/** \brief  21A0, SBAB Record */
#define PFI05_SBAB13_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F821A0u)

/** Alias (User Manual Name) for PFI05_SBAB13_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB13_SBABRECORD.
*/
#define	PFI5_SBABRECORD13	(PFI05_SBAB13_SBABRECORD)

/** \brief  21C0, SBAB Record */
#define PFI05_SBAB14_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F821C0u)

/** Alias (User Manual Name) for PFI05_SBAB14_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB14_SBABRECORD.
*/
#define	PFI5_SBABRECORD14	(PFI05_SBAB14_SBABRECORD)

/** \brief  21E0, SBAB Record */
#define PFI05_SBAB15_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F821E0u)

/** Alias (User Manual Name) for PFI05_SBAB15_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB15_SBABRECORD.
*/
#define	PFI5_SBABRECORD15	(PFI05_SBAB15_SBABRECORD)

/** \brief  2200, SBAB Record */
#define PFI05_SBAB16_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82200u)

/** Alias (User Manual Name) for PFI05_SBAB16_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB16_SBABRECORD.
*/
#define	PFI5_SBABRECORD16	(PFI05_SBAB16_SBABRECORD)

/** \brief  2020, SBAB Record */
#define PFI05_SBAB1_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82020u)

/** Alias (User Manual Name) for PFI05_SBAB1_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB1_SBABRECORD.
*/
#define	PFI5_SBABRECORD1	(PFI05_SBAB1_SBABRECORD)

/** \brief  2040, SBAB Record */
#define PFI05_SBAB2_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82040u)

/** Alias (User Manual Name) for PFI05_SBAB2_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB2_SBABRECORD.
*/
#define	PFI5_SBABRECORD2	(PFI05_SBAB2_SBABRECORD)

/** \brief  2060, SBAB Record */
#define PFI05_SBAB3_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82060u)

/** Alias (User Manual Name) for PFI05_SBAB3_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB3_SBABRECORD.
*/
#define	PFI5_SBABRECORD3	(PFI05_SBAB3_SBABRECORD)

/** \brief  2080, SBAB Record */
#define PFI05_SBAB4_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82080u)

/** Alias (User Manual Name) for PFI05_SBAB4_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB4_SBABRECORD.
*/
#define	PFI5_SBABRECORD4	(PFI05_SBAB4_SBABRECORD)

/** \brief  20A0, SBAB Record */
#define PFI05_SBAB5_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F820A0u)

/** Alias (User Manual Name) for PFI05_SBAB5_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB5_SBABRECORD.
*/
#define	PFI5_SBABRECORD5	(PFI05_SBAB5_SBABRECORD)

/** \brief  20C0, SBAB Record */
#define PFI05_SBAB6_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F820C0u)

/** Alias (User Manual Name) for PFI05_SBAB6_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB6_SBABRECORD.
*/
#define	PFI5_SBABRECORD6	(PFI05_SBAB6_SBABRECORD)

/** \brief  20E0, SBAB Record */
#define PFI05_SBAB7_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F820E0u)

/** Alias (User Manual Name) for PFI05_SBAB7_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB7_SBABRECORD.
*/
#define	PFI5_SBABRECORD7	(PFI05_SBAB7_SBABRECORD)

/** \brief  2100, SBAB Record */
#define PFI05_SBAB8_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82100u)

/** Alias (User Manual Name) for PFI05_SBAB8_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB8_SBABRECORD.
*/
#define	PFI5_SBABRECORD8	(PFI05_SBAB8_SBABRECORD)

/** \brief  2120, SBAB Record */
#define PFI05_SBAB9_SBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_SBABRECORD*)0xA8F82120u)

/** Alias (User Manual Name) for PFI05_SBAB9_SBABRECORD.
* To use register names with standard convension, please use PFI05_SBAB9_SBABRECORD.
*/
#define	PFI5_SBABRECORD9	(PFI05_SBAB9_SBABRECORD)

/** \brief  C000, ZBAB Record */
#define PFI05_ZBAB0_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA8F8C000u)

/** Alias (User Manual Name) for PFI05_ZBAB0_ZBABRECORD.
* To use register names with standard convension, please use PFI05_ZBAB0_ZBABRECORD.
*/
#define	PFI5_ZBABRECORD0	(PFI05_ZBAB0_ZBABRECORD)

/** \brief  C020, ZBAB Record */
#define PFI05_ZBAB1_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA8F8C020u)

/** Alias (User Manual Name) for PFI05_ZBAB1_ZBABRECORD.
* To use register names with standard convension, please use PFI05_ZBAB1_ZBABRECORD.
*/
#define	PFI5_ZBABRECORD1	(PFI05_ZBAB1_ZBABRECORD)

/** \brief  C040, ZBAB Record */
#define PFI05_ZBAB2_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA8F8C040u)

/** Alias (User Manual Name) for PFI05_ZBAB2_ZBABRECORD.
* To use register names with standard convension, please use PFI05_ZBAB2_ZBABRECORD.
*/
#define	PFI5_ZBABRECORD2	(PFI05_ZBAB2_ZBABRECORD)

/** \brief  C060, ZBAB Record */
#define PFI05_ZBAB3_ZBABRECORD /*lint --e(923)*/ (*(volatile Ifx_PFI_ZBABRECORD*)0xA8F8C060u)

/** Alias (User Manual Name) for PFI05_ZBAB3_ZBABRECORD.
* To use register names with standard convension, please use PFI05_ZBAB3_ZBABRECORD.
*/
#define	PFI5_ZBABRECORD3	(PFI05_ZBAB3_ZBABRECORD)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPFI_REG_H */
